#ifndef __NET_FTP_RESPONSE_CODE_H__
#define __NET_FTP_RESPONSE_CODE_H__

namespace net::ftp 
{
    enum class FtpResponseCode : short
    {
        invalid = -1,
        __120__ = 120,                    // 服务不久即将就绪
        __125__ = 125,                    // 数据连接打开；数据传输不久即将开始
        __150__ = 150,                    // 文件状态是 ok

        __200__ = 200,                    // 命令 OK
        __211__ = 211,                    // 系统状态或求助回答
        __212__ = 212,                    // 目录状态
        __213__ = 213,                    // 文件状态
        __214__ = 214,                    // 求助报文
        __215__ = 215,                    // 命令系统类型（操作系统）
        __220__ = 220,                    // 服务就绪
        __221__ = 221,                    // 服务关闭
        __225__ = 225,                    // 数据连接打开
        __226__ = 226,                    // 关闭数据连接
        __227__ = 227,                    // 进入被动方式，服务器发送 ip 地址和端口号
        __230__ = 230,                    // 用户登录 ok
        __250__ = 250,                    // 请求文件动作 ok

        __331__ = 331,                    // 用户名ok，需要口令
        __332__ = 332,                    // 需要登录账号
        __350__ = 350,                    // 文件动作进行中：需要更多信息

        __425__ = 425,                    // 不能打开数据连接
        __426__ = 426,                    // 连接关闭：不能识别的命令
        __450__ = 450,                    // 未采取文件动作：文件不可用
        __451__ = 451,                    // 动作异常终止：本地差错
        __452__ = 452,                    // 动作异常终止：存储器不足

        __500__ = 500,                    // 语法差错：不能识别的命令
        __501__ = 501,                    // 参数货变量的语法错误
        __502__ = 502,                    // 命令未实现
        __503__ = 503,                    // 不良命令序列
        __504__ = 504,                    // 命令参数未实现
        __530__ = 530,                    // 用户未登录
        __532__ = 532,                    // 存储文件需要登录账号
        __550__ = 550,                    // 动作未完成：文件不可用
        __552__ = 552,                    // 请求动作异常终止：超过分配的存储器空间
        __553__ = 553,                    // 未采取请求动作：文件名不允许
    };
}

#endif